/*
日期: 2026-10-14  
时间：18:30-20:30
第四节课
授课：听小昕碎碎念  
记录：凡尘

UVA10696 f91
题目描述
McCarthy 是一个很出名的计算机科学家。有一天，他研究出一个有（WU）趣（LIAO）的函数，叫"f91"。函数功能如下：
如果 n≤100 则 f91(n)=f91(f91(n+11))
如果 n≥101 则 f91(n)=n-10
然而McCarthy 的电脑坏了，所以求助你来编一个程序来研究这个神奇的函数。

输入格式
无

输出格式
（等号两边有空格）
Translated by @asd_a
输入输出样例 #1
输入 #1
500
91
0

输出 #1
f91(500) = 490
f91(91) = 91
*/

//方案一：递归
#include<stdio.h>
int m;
int f91(int n)
{
    if(n <= 100) return f91(f91(n + 11));
    else return n - 10;
}

int main()
{
	while(scanf("%d", &m) == 1 && m != 0)//多组输入
	  printf("f91(%d) = %d\n", m, f91(m));//格式输出
	return 0;
}

//方案二：数学证明（这很重要，很多题都可以证明后直接输出答案--凡尘学长个人见解）
题目分析
这道题其实就是著名的f91函数。
这个函数的神奇之处就在于，依照题目的规则，只要x≤100，最终一定会得到91这个答案，否则返回x−10。
下面给出证明：

已知：f(x)={ 
f(f(x+11)),x≤100
x−10,x≥100
​
 .
求证：f(x)={ 
91,x≤100
x−10,x≥100
​
 .
证明：
若x≥101,直接返回x−10即可，十分简单。
若x≤100，设x=11k+m(k∈N,m∈N∩[0,10])；
若m=1,f(x)=f 
2
​
 [11k+12]=f 
3
​
 [11k+23]=……=f 
n
​
 (111)=f 
n−1
​
 (101)=f 
n−2
​
 (91)=…(可以自己尝试写一下中间过程)…=f 
n−3
​
 (91)=…………=f(91)=……91。（此处f 
n
​
 (x)表示 
f(f(⋯f(x)))
​
 
n个f
​
  ）
若m=2,f(x)=f 
2
​
 [11k+13]=……=f 
n
​
 (101)=f 
n−1
​
 (91)=…………f(91)=91。
⋯⋯⋯
若m=10,f(x)=f 
2
​
 [11k+21]=……=f 
n
​
 (109)……=f(91)=91。
综上，无论k,m为何值，均满足题意：f(x)={ 
91,x≤100
x−10,x≥100
​
 .

命题得证。
为什么会出现这样“神奇”的情况呢？秘密就在于：
当x≤100时，f(x)经过数次操作必然会变成f 
n
​
 (y),(91≤y≤100)，而f 
n
​
 (y)=f 
n+1
​
 (y+11)=f 
n
​
 (y+1)=f 
n+1
​
 (y+12)=f 
n
​
 (y+2)=……=f 
n
​
 (101)=f 
n−1
​
 (91)，此时函数的“次数”(也就是函数下标n)减少了1，经过n轮这样的操作后必然会得到f(x)=f 
n
​
 (91)=f(91)=91。
现在，我们了解了f91函数的原理，可以开始写代码了。

代码：
主函数(别忘了UVA的格式)：

int main(){
	int n;
	scanf("%d",&n);
	while(n)
	{
		printf("f91(%d) = %d\n",n,f91(n));
		scanf("%d",&n);
	}
	return 0;
} 

f91函数：

int f91(int x)
{
	return x <= 100 ? 91 : x - 10; 
}

全部代码：

#include<bits/stdc++.h>
using namespace std;
int f91(int x)
{
	return x <= 100 ? 91 : x - 10; 
}
int main(){
	int n;
	scanf("%d",&n);
	while(n)
	{
		printf("f91(%d) = %d\n",n,f91(n));
		scanf("%d",&n);
	}
	return 0;
}